---
kind: type
id: T:Autodesk.Revit.DB.DXFExportOptions
source: html/00783eca-208f-cc58-d56f-b47814a6957a.htm
---
# Autodesk.Revit.DB.DXFExportOptions

The export options used by exporting DXF format file.

## Syntax (C#)
```csharp
public class DXFExportOptions : ACADExportOptions
```